from utils import create_dirs_if_not_exist, csv_to_list
from dough_crawler import crawl
from firebase_db import convert_documents_and_upload_to_db, update_station_db_in_case_convert_documents_and_upload_to_db_terminated_unexpectedly, update_cluster
import os
import argparse

if __name__ == "__main__":
    ## parse execution options
    parser = argparse.ArgumentParser(description='Which functionality do you want to run?')
    parser.add_argument('--disk_path', required=True, help="path to mount location of disk, e.g. /media/k")
    parser.add_argument('--execution_kind', required=True,  choices=['crawl', 'upload', 'update_station', 'update_cluster'])
    # upload_num only needed for `'upload'` case
    parser.add_argument('--upload_num', choices=[0,1,2,3], type=int, default=-1)
    parser.add_argument('--crawler_num', choices=[0,1,2,3], type=int, default=-1)
    args = parser.parse_args()
    disk_path = args.disk_path
    execution_kind = args.execution_kind
    upload_num = args.upload_num
    crawler_num = args.crawler_num
    
    if execution_kind == 'upload':
        assert upload_num in [0,1,2,3], "should provided different upload num for each terminal, chosen from 0,1,2,3"
    if execution_kind == 'crawl':
        assert crawler_num in [0,1,2,3], "should provided different crawler num for each terminal, chosen from 0,1,2,3"

    ## shared configs
    DB_DIR_PATH = f"{disk_path}/DIR_FOR_CRAWLING/raw_db"
    PHOTO_DIR_PATH = f"{disk_path}/DIR_FOR_CRAWLING/temp_img"
    LOG_DIR_PATH = f"{disk_path}/DIR_FOR_CRAWLING/log"
    CATEGORY_TO_TAG_TABLE_DIR_PATH = "./cat_to_tag_table"
    create_dirs_if_not_exist([DB_DIR_PATH, PHOTO_DIR_PATH, LOG_DIR_PATH, CATEGORY_TO_TAG_TABLE_DIR_PATH])

    ## configs for crawling
    DO_CRAWL = execution_kind == 'crawl'
    CRAWLER_NUM = int(crawler_num)
    ALL_STATIONS = [station+"역" for station in csv_to_list("./all_metro_list.csv")]
    ALREADY_CRAWLED_STATIONS = ['가정중앙시장역', '가좌역', '가천대역', '강남대역', '강남역', '강동역', '강매역', '강촌역', '개롱역', '개봉역', '개포동역', '개화역', '건대입구역', '검단사거리역', '계산역', '계양역', '고속터미널역', '고잔역', '곡산역', '공릉역', '관악역', '광명사거리역', '구래역', '구로디지털단지역', '구반포역', '구산역', '구의역', '구일역', '굴봉산역', '굽은다리역', '귤현역', '금곡역', '금천구청역', '금촌역', '기흥역', '길동역', '길음역', '김량장역', '김유정역', '김포공항역', '까치산역', '남춘천역', '남한산성입구역', '녹천역', '달미역', '답십리역', '대야미역', '대청역', '대치역', '대흥역', '덕소역', '덕정역', '도화역', '독바위역', '독정역', '돌곶이역', '동대입구역', '동두천역', '동두천중앙역', '동인천역', '동춘역', '둔전역', '둔촌오륜역', '마두역', '마산역', '마장역', '마포구청역', '마포역', '망우역', '면목역', '명일역', '모란역', '무악재역', '문래역', '문정역', '미금역', '미아역', '발곡역', '백석역', '백양리역', '버티고개역', '범골역', '보산역', '봉천역', '부발역', '부천시청역', '부천역', '북한산우이역', '불광역', '사당역', '사릉역', '사리역', '산곡역', '산성역', '삼산체육관역', '삼송역', '삼양역', '상갈역', '상록수역', '상봉역', '상일동역', '상현역', '서울대입구역', '서울숲역', '서울역역', '서정리역', '서현역', '석계역', '석남역', '석바위시장역', '석천사거리역', '선릉역', '선정릉역', '선학역', '성균관대역', '성신여대입구역', '성환역', '세류역', '소래포구역', '소사역', '솔밭공원역', '송내역', '송산역', '송탄역', '송파역', '수원시청역', '수진역', '숭의역', '시우역', '시청역', '시흥능곡역', '시흥대야역', '신갈역', '신내역', '신논현역', '신당역', '신목동역', '신사역', '신설동역', '신연수역', '신용산역', '신중동역', '신풍역', '신현역', '아산역', '안국역', '안산역', '안양역', '야목역', '약수역', '양재시민의숲역', '양정역', '양주역', '양천향교역', '어룡역', '어천역', '여의도역', '역곡역', '역촌역', '연수역', '영등포구청역', '영등포역', '예술회관역', '오금역', '오류동역', '오목천역', '오산역', '오이도역', '온수역', '온양온천역', '왕십리역', '용두역', '용문역', '운연역', '원당역', '원덕역', '원시역', '월드컵경기장역', '을지로3가역', '을지로입구역', '이태원역', '인천공항2터미널역', '인천역', '인천터미널역', '인하대역', '일원역', '임학역', '작전역', '잠실역', '장승배기역', '장한평역', '전대.에버랜드역', '정발산역', '정부과천청사역', '정자역', '제물포역', '종합운동장역', '중곡역', '중화역', '증미역', '지석역', '지축역', '지행역', '진위역', '천안역', '천호역', '청계산입구역', '청담역', '청명역', '탑석역', '테크노파크역', '퇴계원역', '파주역', '판교역', '평택역', '풍산역', '학여울역', '한남역', '한대앞역', '한양대역', '홍대입구역', '효자역', '효창공원앞역', '흥선역']

    ALL_STATIONS_TO_CRAWL = list(set(ALL_STATIONS) - set(ALREADY_CRAWLED_STATIONS))
    NUM_STATIONS_TO_CRAWL_PER_TERMINAL = int(len(ALL_STATIONS_TO_CRAWL) / len([0,1,2,3]))
    STATIONS_TO_CRAWL = ALL_STATIONS_TO_CRAWL[CRAWLER_NUM*NUM_STATIONS_TO_CRAWL_PER_TERMINAL : (CRAWLER_NUM+1)*NUM_STATIONS_TO_CRAWL_PER_TERMINAL]

    SEARCH_KEYWORD = ['술집', '카페', '맛집']
    CRAWLER_OPTIONS = dict(log=True, msg=True)    
    CRAWL_ONLY_TEN_PLACES_FOR_TEST = False

    ## configs for upload
    DO_UPLOAD = execution_kind=='upload'
    UPLOAD_NUM = int(upload_num)
    ALREADY_UPLOADED_STATIONS = ['효창공원앞역_맛집', '범골역_카페', '마포구청역_맛집', '까치산역_카페', '풍산역_술집', '돌곶이역_맛집', '상갈역_카페', '김유정역_술집', '동두천중앙역_맛집', '서울대입구역_카페', '사리역_술집', '양재시민의숲역_맛집', '예술회관역_술집', '동인천역_술집', '야목역_술집', '솔밭공원역_카페', '수지구청역_술집', '영등포구청역_카페', '동두천역_술집', '전대.에버랜드역_맛집', '남한산성입구역_카페', '청명역_카페', '백석역_맛집', '모란역_술집', '개봉역_카페', '서현역_술집', '안국역_맛집', '금촌역_술집', '온수역_술집', '고잔역_카페', '어룡역_술집', '서현역_맛집', '강매역_술집']
    ALREADY_UPLOADED_STATIONS += ['가정중앙시장역_맛집', '가정중앙시장역_술집', '가정중앙시장역_카페', '가좌역_맛집', '가좌역_술집', '가좌역_카페', '가평역_술집', '가평역_카페', '강남대역_맛집', '강남대역_술집', '강남대역_카페', '독바위역_술집', '독바위역_카페', '독정역_맛집', '독정역_술집', '독정역_카페', '돌곶이역_술집', '돌곶이역_카페', '동두천역_맛집', '동두천역_카페', '동두천중앙역_술집', '동두천중앙역_카페', '동인천역_맛집', '동인천역_카페', '동춘역_맛집', '동춘역_술집', '동춘역_카페', '둔전역_맛집', '둔전역_술집', '둔전역_카페', '둔촌오륜역_맛집', '둔촌오륜역_술집', '둔촌오륜역_카페', '마곡나루역_술집', '마곡나루역_카페', '마두역_맛집', '마두역_술집', '마두역_카페', '마장역_맛집', '마장역_술집', '마장역_카페', '마포구청역_술집', '마포구청역_카페', '마포역_맛집', '마포역_술집', '마포역_카페', '명일역_맛집', '명일역_술집', '명일역_카페', '모란역_맛집', '모란역_카페', '문래역_맛집', '문래역_술집', '문래역_카페', '문정역_맛집', '문정역_술집', '문정역_카페', '서현역_카페', '석계역_맛집', '석계역_술집', '석계역_카페', '석바위시장역_맛집', '석바위시장역_술집', '석바위시장역_카페', '석천사거리역_맛집', '석천사거리역_술집', '석천사거리역_카페', '선릉역_맛집', '연수역_맛집', '연수역_술집', '연수역_카페', '영등포구청역_맛집', '영등포구청역_술집', '영등포역_맛집', '영등포역_술집', '영등포역_카페', '예술회관역_맛집', '예술회관역_카페', '오목천역_맛집', '오목천역_술집', '오목천역_카페', '오산대역_술집', '오산역_맛집', '오산역_술집', '오산역_카페', '온수역_맛집', '온수역_카페', '왕십리역_맛집', '왕십리역_술집', '왕십리역_카페', '원당역_맛집', '원당역_술집', '원당역_카페', '원덕역_맛집', '원덕역_술집', '원덕역_카페', '월드컵경기장역_맛집', '월드컵경기장역_술집', '월드컵경기장역_카페']
    ALREADY_UPLOADED_STATIONS += ['강남역_맛집', '강남역_술집', '강남역_카페', '강동역_맛집', '강동역_술집', '강동역_카페', '강매역_맛집', '강매역_카페', '강촌역_맛집', '강촌역_술집', '강촌역_카페', '개봉역_맛집', '개봉역_술집', '개포동역_맛집', '개포동역_술집', '개포동역_카페', '개화역_맛집', '개화역_술집', '개화역_카페', '대청역_술집', '대청역_카페', '대치역_맛집', '대치역_술집', '대치역_카페', '대흥역_맛집', '대흥역_술집', '대흥역_카페', '덕소역_맛집', '덕소역_술집', '덕소역_카페', '덕정역_맛집', '덕정역_술집', '덕정역_카페', '도화역_맛집', '도화역_술집', '도화역_카페', '독바위역_맛집', '동대입구역_맛집', '동대입구역_술집', '동대입구역_카페', '망우역_맛집', '망우역_술집', '망우역_카페', '미금역_맛집', '미금역_술집', '미금역_카페', '발곡역_맛집', '발곡역_술집', '발곡역_카페', '백석역_술집', '백석역_카페', '백양리역_맛집', '백양리역_술집', '백양리역_카페', '버티고개역_맛집', '버티고개역_술집', '버티고개역_카페', '범골역_맛집', '범골역_술집', '봉천역_맛집', '봉천역_술집', '봉천역_카페', '성신여대입구역_카페', '성환역_맛집', '성환역_술집', '성환역_카페', '소래포구역_맛집', '소래포구역_술집', '소래포구역_카페', '소사역_맛집', '소사역_술집', '소사역_카페', '솔밭공원역_맛집', '솔밭공원역_술집', '송내역_맛집', '송내역_술집', '송내역_카페', '송탄역_맛집', '송탄역_술집', '송탄역_카페', '송파역_맛집', '송파역_술집', '송파역_카페', '수원시청역_맛집', '수원시청역_술집', '수원시청역_카페', '수지구청역_카페', '수진역_맛집', '수진역_술집', '수진역_카페', '숭의역_맛집', '숭의역_술집', '숭의역_카페', '시우역_맛집', '시우역_술집', '시우역_카페', '시흥능곡역_맛집', '시흥능곡역_술집', '시흥능곡역_카페', '시흥대야역_맛집', '시흥대야역_술집', '시흥대야역_카페', '신갈역_맛집', '신갈역_술집', '신갈역_카페', '신금호역_술집', '신금호역_카페', '신당역_맛집', '신당역_술집', '신당역_카페', '신사역_맛집', '신사역_술집', '신사역_카페', '신설동역_맛집', '신설동역_술집', '신설동역_카페', '신연수역_맛집', '신연수역_술집', '신연수역_카페', '신용산역_맛집', '신용산역_술집', '신용산역_카페', '신중동역_맛집', '신중동역_술집', '신중동역_카페', '신풍역_맛집', '신풍역_술집', '신풍역_카페', '신현역_맛집', '신현역_술집', '신현역_카페', '아산역_맛집', '아산역_술집', '아산역_카페', '안국역_술집', '안국역_카페', '안산역_맛집', '안산역_술집', '안산역_카페', '야목역_맛집', '야목역_카페', '약수역_맛집', '약수역_술집', '약수역_카페', '양재시민의숲역_술집', '양재시민의숲역_카페', '양정역_맛집', '양정역_술집', '양정역_카페', '양주역_맛집', '양주역_술집', '양주역_카페', '양천향교역_맛집', '양천향교역_술집', '양천향교역_카페', '어룡역_맛집', '어룡역_카페', '어천역_맛집', '어천역_술집', '어천역_카페', '역곡역_맛집', '역곡역_술집', '오류동역_맛집', '오류동역_술집', '오류동역_카페', '오이도역_맛집', '오이도역_술집', '오이도역_카페', '용두역_맛집', '용두역_술집', '용두역_카페', '운연역_맛집', '운연역_술집', '운연역_카페', '을지로3가역_맛집', '을지로3가역_술집', '을지로3가역_카페', '을지로입구역_맛집', '을지로입구역_술집', '을지로입구역_카페', '이태원역_맛집', '이태원역_술집', '이태원역_카페', '인천공항2터미널역_맛집', '인천공항2터미널역_술집', '인천공항2터미널역_카페', '인천터미널역_맛집', '인천터미널역_술집', '인천터미널역_카페', '인하대역_맛집', '인하대역_술집', '인하대역_카페', '작전역_맛집', '작전역_술집', '작전역_카페', '잠실역_맛집', '잠실역_술집', '잠실역_카페', '장한평역_맛집', '장한평역_술집', '장한평역_카페', '전대.에버랜드역_술집', '전대.에버랜드역_카페', '정발산역_맛집', '정발산역_술집', '정발산역_카페', '정부과천청사역_맛집', '정부과천청사역_술집', '정부과천청사역_카페', '정자역_맛집', '정자역_술집', '정자역_카페', '제물포역_맛집', '제물포역_술집', '제물포역_카페', '중곡역_맛집', '중곡역_술집', '중곡역_카페', '지석역_맛집', '지석역_술집', '지석역_카페', '지축역_맛집', '지축역_술집', '지축역_카페', '지행역_맛집', '지행역_술집', '지행역_카페', '진위역_맛집', '진위역_술집', '진위역_카페', '청계산입구역_맛집', '청계산입구역_술집', '청계산입구역_카페', '청명역_맛집', '청명역_술집', '탑석역_맛집', '탑석역_술집', '탑석역_카페', '퇴계원역_맛집', '퇴계원역_술집', '퇴계원역_카페', '파주역_맛집', '파주역_술집', '파주역_카페', '풍산역_맛집', '풍산역_카페', '한남역_맛집', '한남역_술집', '한남역_카페', '한대앞역_맛집', '한대앞역_술집', '한대앞역_카페', '한양대역_맛집', '한양대역_술집', '한양대역_카페', '홍대입구역_맛집', '홍대입구역_술집', '홍대입구역_카페', '효자역_맛집', '효자역_술집', '효자역_카페', '효창공원앞역_술집']
    ALREADY_UPLOADED_STATIONS += ['가천대역_맛집', '가천대역_술집', '가천대역_카페', '개롱역_맛집', '개롱역_술집', '개롱역_카페', '길동역_맛집', '길동역_술집', '길동역_카페', '길음역_맛집', '길음역_술집', '길음역_카페', '사리역_카페', '산곡역_맛집', '산곡역_술집', '산곡역_카페', '산성역_맛집', '산성역_술집', '산성역_카페', '삼산체육관역_맛집', '삼산체육관역_술집', '신목동역_술집', '신목동역_카페']
  
    STATIONS_CRAWLED = os.listdir(DB_DIR_PATH)
    ALL_STATIONS_TO_UPLOAD = sorted(list(set(STATIONS_CRAWLED)-set(ALREADY_UPLOADED_STATIONS)))
    NUM_STATIONS_TO_UPLOAD_PER_TERMINAL = int(len(ALL_STATIONS_TO_UPLOAD) / len([0,1,2,3]))
    STATIONS_TO_UPLOAD = ALL_STATIONS_TO_UPLOAD[UPLOAD_NUM*NUM_STATIONS_TO_UPLOAD_PER_TERMINAL : (UPLOAD_NUM+1)*NUM_STATIONS_TO_UPLOAD_PER_TERMINAL]

    ## configs for upload_station
    DO_UPDATE_STATION_DB_IN_CASE_UPLOAD_TERMINATED_UNEXPECTEDLY = execution_kind == 'update_station'

    ## configs for update_cluster
    DO_UPADTE_CLUSTER = execution_kind == 'update_cluster'
    CLUSTER_RESULT_PATH = "./sample_cluster_result.pkl"

    if DO_CRAWL:
        print(STATIONS_TO_CRAWL)        
        crawl(STATIONS_TO_CRAWL, SEARCH_KEYWORD, CRAWLER_OPTIONS, DB_DIR_PATH, PHOTO_DIR_PATH, LOG_DIR_PATH, CRAWL_ONLY_TEN_PLACES_FOR_TEST)
    if DO_UPLOAD:
        print(STATIONS_TO_UPLOAD)
        convert_documents_and_upload_to_db (STATIONS_TO_UPLOAD, DB_DIR_PATH,  PHOTO_DIR_PATH, CATEGORY_TO_TAG_TABLE_DIR_PATH)
    if DO_UPDATE_STATION_DB_IN_CASE_UPLOAD_TERMINATED_UNEXPECTEDLY:
        update_station_db_in_case_convert_documents_and_upload_to_db_terminated_unexpectedly(STATIONS_CRAWLED, DB_DIR_PATH)
    if DO_UPADTE_CLUSTER:
        update_cluster(CLUSTER_RESULT_PATH)
